{
    "title": "План выполнения. Отчет",
    "items": [
        {
            "type": "text",
            "data": [
                {
                    "text": "План деятельности за семестр",
                    "class": "md-title"
                }
            ]
        },
        {
            "type": "text",
            "data": [
                {
                    "text": " 1. Выбрать для формализации прецедент, записать выбранное как индивидуальное задание на личной странице в ходе лабораторной №1.
2. Сформировать личную веб-страницу хостинге с использованием HTML, CSS, JS.
3. Описать выбранный прецедент.
4. Сформировать диаграмму Use Case.
5. Вписать ссылку на личную веб-страницу в список группы.
6. Определиться с ролями в коллективной работе.
7. Определиться с проектами.
8. Определиться с любимой задачей в выбранном проекте.
9. Подготовить предложения о кандидатуре временного РП выбранного проекта.
10. Определиться с типовой стратегией управления выбранным риском.
11. Подготовить предложения о необходимом наборе статусов задач в Канбан-доске выбранного проекта.
12. Определиться с основным мероприятием управления рисками в выбранной стратегии.
13. Записать все сделанные выборы в ходе лабораторной №2 как можно точнее и детальнее.
14. Заполнить личную веб-страницу.
15. Описать набор сущностей тестового приложения.
16. Сформировать диаграмму Class.
17. Описать смысл приложения.
18. Сформировать UML Sequence.
19. Описать компоненты приложения с помощью диаграммы UML Component.
20. Создать приложение на Angular 7.
21. Опубликовать приложение на хостинге Github Pages.
22. Описать результаты выполнения лабораторной работы на личной веб-странице.
23. Зарегистрировать участников проекта.
24. Сделать описания для всех подзадач, требующих программной реализации.
25. Скорректировать или сделать новые описания для всех разработанных процедур в виде вики-страницы или в виде комментариев в файле программы и сохранить данные в репозитории.
26. Принять решение по всем возникающим проблемам.
27. Разработать требуемые описания всех разработанных процедур, тестов и тестовых наборов данных в соответствии с требованиями.
28. Принять решение об успешности спринта, дать общую оценку работы команды и предложения по всем индивидуальным оценкам.
29. Выбрать ключевой прототип дипломного проекта, провести его классификацию.
30. Определить прикладную задачу и основные требования к личной SPA.
31. Выбрать пользовательскую историю для коллективной разработки.
"
                }
            ]
        },
   
    ]
}
